In [6]:
import pandas as pd

In [7]:
df=pd.read_csv('/Users/rupaliwadhawan/Downloads/new_data.csv')

In [8]:
df

,Unnamed: 0,event_time,event_type,product_id,category_id,category_code,brand,price,user_id,user_session
0,0,2019-11-01 00:00:00 UTC,view,1003461,2053013555631882655,electronics.smartphone,xiaomi,489.07,520088904,4d3b30da-a5e4-49df-b1a8-ba5943f1dd33
1,1,2019-11-01 00:00:00 UTC,view,5000088,2053013566100866035,appliances.sewing_machine,janome,293.65,530496790,8e5f4f83-366c-4f70-860e-ca7417414283
2,2,2019-11-01 00:00:01 UTC,view,17302664,2053013553853497655,NaN,creed,28.31,561587266,755422e7-9040-477b-9bd2-6a6e8fd97387
3,3,2019-11-01 00:00:01 UTC,view,3601530,2053013563810775923,appliances.kitchen.washer,lg,712.87,518085591,3bfb58cd-7892-48cc-8020-2f17e6de6e7f
4,4,2019-11-01 00:00:01 UTC,view,1004775,2053013555631882655,electronics.smartphone,xiaomi,183.27,558856683,313628f1-68b8-460d-84f6-cec7a8796ef2
...,...,...,...,...,...,...,...,...,...,...
9999995,9999995,2019-11-07 05:08:21 UTC,view,1005115,2053013555631882655,electronics.smartphone,apple,915.69,517800555,c6b764e0-561c-4c17-a546-2e922196bb49
9999996,9999996,2019-11-07 05:08:21 UTC,view,12707281,2053013553559896355,NaN,gislaved,90.86,539095445,b1673b33-d0ff-4a09-bf57-56dedc3d016e
9999997,9999997,2019-11-07 05:08:21 UTC,view,3601405,2053013563810775923,appliances.kitchen.washer,beko,180.16,548916637,e020a307-551c-4e58-a787-126701d30d41
9999998,9999998,2019-11-07 05:08:21 UTC,view,12711053,2053013553559896355,NaN,tunga,32.69,521586999,c8c48941-2ca1-4ce4-8d44-c96eb5df4fb5
9999999,9999999,2019-11-07 05:08:21 UTC,cart,1005121,2053013555631882655,electronics.smartphone,apple,947.98,563025983,9b19a94a-78b9-4ff8-8334-f48eed7cc0a0

In [13]:
df1=df['event_type']=='purchase'

In [14]:
df1.any()

True

In [22]:
df_productgroup = df.groupby('product_id').count()

In [72]:
df.columns

Index(['Unnamed: 0', 'event_time', 'event_type', 'product_id', 'category_id',
       'category_code', 'brand', 'price', 'user_id', 'user_session'],
      dtype='object')

In [ ]:
df.groupby('product_id')['']

In [74]:
df[df['event_type']=='purchase'].groupby('product_id').agg(
    {'product_id' : 'count',
     'price' : 'sum'})

            product_id    price
product_id
1000978              2   601.82
1001588              1   127.86
1002098              8  2965.12
1002100              7  2594.48
1002101             23  8524.72
...                ...      ...
60500001             8   201.60
60500002             1    42.19
61700004             2   303.74
61700006             1   254.83
61700014             1   203.35

[18298 rows x 2 columns]

In [9]:
df_purchase_by_product = df[df['event_type']=='purchase'].groupby('product_id').agg(
    {'product_id' : 'count',
     'price' : 'sum'}
)

In [10]:
df_purchase_by_product.reset_index

<bound method DataFrame.reset_index of             product_id    price
product_id
1000978              2   601.82
1001588              1   127.86
1002098              8  2965.12
1002100              7  2594.48
1002101             23  8524.72
...                ...      ...
60500001             8   201.60
60500002             1    42.19
61700004             2   303.74
61700006             1   254.83
61700014             1   203.35

[18298 rows x 2 columns]>

In [11]:
df_purchase_by_product.sort_values('price',ascending=False).head(20)

            product_id       price
product_id
1005115           3750  3472141.71
1005105           1667  2237694.16
1004249           1742  1276299.70
1005135            733  1211693.39
1004767           4288  1036294.62
1002544           2179  1009721.35
1004856           5416   701885.35
1005116            644   637802.43
1002524           1050   568530.08
1004870           1974   535046.34
1003317            507   475410.13
1003306            806   463832.79
1005106            301   430708.79
1004833           2518   428981.67
1005129            315   414414.41
1004873           1105   399448.44
4804056           2401   384837.82
1004659            527   374812.85
1005144            226   370094.29
1004836           1496   339505.59

In [63]:
df_purchase_by_product.columns

Index(['count', 'price'], dtype='object')

In [12]:
df_purchase_by_product['product_id'].astype(str)

product_id
1000978      2
1001588      1
1002098      8
1002100      7
1002101     23
            ..
60500001     8
60500002     1
61700004     2
61700006     1
61700014     1
Name: product_id, Length: 18298, dtype: object

In [14]:
df_purchase_by_product['product_id'].astype(str)

product_id
1000978      2
1001588      1
1002098      8
1002100      7
1002101     23
            ..
60500001     8
60500002     1
61700004     2
61700006     1
61700014     1
Name: product_id, Length: 18298, dtype: object

In [ ]:
df_purchase_by_product

In [15]:
df_mostsales = df.groupby('product_id').sum('price').head(10).sort_values('price', ascending=False)

In [40]:
df_mostsales

             Unnamed: 0          category_id       price        user_id
product_id
1002101     18886891991   926694828351737714  1452167.52  2111137133755
1002100      6415491707 -5465355315731433193   525196.88   760084830039
1002098      5317412498 -6012158001324494215   465153.20   674522777540
1002099      4776798576  1227802557926483477   402508.63   536972046917
1000978      6860464698 -1250501975388891084   253980.69   453146048406
1001588      2090259577  7556425307855692799    53314.79   225334298894
1000365         7752964  2053013555631882655     1029.09      525766088
1002042        33918340    30377926977392279      694.26     4998413863
1001606         2832278  2053013555631882655      363.07      561997780
1002062        10913640  6159040666895647965      322.77     1596383514

In [ ]:
import seaborn as sns

In [16]:
sns.histplot(data=df_purchase_by_product, x='product_id', y='price')

:

:

In [5]:
sns.histplot(data=df_mostsales, x='product_id', y='price')

NameError: name 'df_mostsales' is not defined